[
	{
		"name":	"common_rust",
		"symptoms": "Minute flecks appear on both sides of the leaves and slowly develop into small, tan, slightly raised spots. These mainly elongated spots later turn into powdery, golden-brown pustules loosely scattered in patches on upper and lower sides. The color can change to black as the plant matures. Contrarily to other rust diseases, symptoms are not usually present on other plant parts, such as stalks, sheath leaves or husks. However, stalks tend to grow weak and soft and are prone to lodging. Younger leaf tissue is more susceptible to fungal infection than mature leaves. Plants infected during the early stages can show chlorosis of leaves and death, leading to high yield losses if upper leaves are affected.",
		"trigger": "The disease is caused by the fungus Puccinia sorghi. The fungus overwinters in an alternate host (a species of Oxalis) and releases spores during the spring. The spores can be transported over great distances by winds and rain. They start the infection process when landing on the leaves. Secondary infection from plant to plant can also occur due to wind and rain. The development of the disease is favored by high relative humidities (nearly 100%), dew, rain and cool temperatures between 15 and 20°C (may vary depending on area). Hot, dry weather will in turn slow or hinder the development of the fungus and the incidence of the disease. It is more a problem in plants used for seed production and sweet corn. Plants cultivated as livestock feed, for industrial products, or to make processed foods are not concerned. Yield is reduced due to lower plant productivity and lodging.",
		"biological_control": "No alternative treatment against Puccinia sorghi is available so far. Please get in touch with us in case you know of anything that might help to fight this disease. Looking forward to hearing from you.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. The application of fungicides can be beneficial when used on susceptible varieties. Apply a foliar fungicide early in the season if rust is bound to spread rapidly due to the weather conditions. Numerous fungicides are available for rust control. Products containing mancozeb, pyraclostrobin, pyraclostrobin + metconazole, pyraclostrobin + fluxapyroxad, azoxystrobin + propiconazole, trifloxystrobin + prothioconazole can be used to control the disease. An example of treatment could be: Spraying of mancozeb @ 2.5 g/l as soon as pustules appear and repeat at 10 days interval till flowering.",
		"preventive_measures": "Plant resistant varieties available locally.\nPlant early to avoid optimal conditions for infection.\nUse shorter season varieties that mature earlier.\nMonitor your crop regularly for signs of the disease, even more so during overcast weather.\nEnsure balanced fertilization with split applications of nitrogen.\nPlan a crop rotation with non-susceptible crops."	
	},
	{
		"name":	"gray_leaf_spot",
		"symptoms": "Small necrotic (brown or tan) spots that may have a yellow chlorotic halo appear on lower leaves, usually before flowering. Gradually these lesions will turn grayish and appear on younger leaves, too. As the disease progresses, they enlarge into elongated, rectangular lesions that run parallel to the leaf veins. In optimal conditions (warm temperatures, high humidity and wet leaves), they can coalesce and engulf the whole leaf. If this happens before grain filling there can be considerable yield losses. The leaf blight can weaken the plants and sometimes soften the stalks, leading to lodging.",
		"trigger": "The gray leaf spot disease is caused by the fungus Cercospora zeae-maydis. It survives in plant residues in the soil for long periods of time. During the spring, the spores are carried onto the lower leaves by rain splashes and wind. Its lifecycle is favored by elevated temperatures (25 to 30°C), high humidity (dews, fogs) and leaf wetness for prolonged periods of time. Hot, dry weather hinders its development. Symptoms vary slightly between different plant varieties. The fungus completes its lifecycle (from infection to production of new spores) in 14-21 days in a susceptible variety and in 21-28 days in a resistant one.",
		"biological_control": "No biological control is available  to control this disease.",
		"chemical_control": "Always consider an integrated approach with preventive measures and biological treatments if available. Foliar fungicide treatment is a way to manage the disease if it occurs at early stages but it has to be weighted against the weather conditions, the potential yield loss and the susceptibility of the plant. Fungicides containing pyraclostrobin and strobilurin, or combinations of azoxystrobin and propiconazole, prothioconazole and trifloxystrobin work well to control the fungus.",
		"preventive_measures": "Plant resistant varieties if available in your area.\nPlant late to avoid adverse conditions for plants.\nKeep up good ventilation by widening the space between plants.\nPlow deep and bury all plant residues after harvest.\nPlan long-term crop rotations with non-host plants."
	},
	{
		"name":	"healthy"
	},
	{
		"name": "northern_leaf_blight",
		"symptoms": "The symptoms appear as small, oval, water-soaked spots on the lower leaves first. As the disease progresses,  they start to appear on the upper part of the plant. Older spots slowly grow into tan, long cigar-shaped necrotic lesions with distinct dark specks and pale green, water-soaked borders. These lesions later coalesce and engulf a large part of the leaf blade and stalk, sometimes leading to death and  lodging. If the infection spreads to the upper parts of the plant during the development of the cob. Severe yield losses can occur (up to 70%).",
		"trigger": "The fungus overwinters in the soil or on plant debris.  Rainfall, night dew, high humidity and moderate temperatures favor the dispersion of the the fungus. Carried by wind or rain splashes it first spreads from the soil onto the lower leaves of young maize plants. Rainy conditions and poor field practices favor its spread to other plants and within fields. Optimal temperatures for infection are in the range of 18 to 27°C during the growing season. A prolonged period of 6 to 18 hours of leaf wetness are also necessary. Sorghum is another favorite host of the fungus.",
		"biological_control": "Bio-fungicides based on Trichoderma harzianum, or Bacillus subtilis can be applied at different stages to decrease the risk of infection. Application of sulfur solutions is also effective.",
		"chemical_control": "An integrated approach with preventive measures together with careful cultural practices is recommended. An early preventative fungicide application can be an effective way of controlling the disease. Otherwise, fungicides can be applied when the symptoms are visible on lower canopy to protect the upper leaves and ears. Apply sprays based on azoxystrobin, picoxystrobin, mancozeb, pyraclostrobin, propiconazole, tetraconazole Apply products based on picoxystrobin + cyproconazole, pyraclostrobin + metconazole, propiconazole + azoxystrobin, prothioconazole + trifloxystrobin.  Seed treatments are not recommended.",
		"preventive_measures": "Grow resistant or tolerant varieties.\nEnsure balanced nutrient supply and avoid excessive nitrogen fertilization.\nWeed regularly in and around the field.\nRotate with soybeans, beans, or sunflower to avoid extensive spreading.\nPlow deep to bury plant debris and reduce the amount inoculum in the soil."
	}
]

