[
	{
		"name":	"canker",
		"nutshell": "Rust-brown, wart-like craters surrounded by yellow halo on leaves.\nLater erupt and form lesions, centers light brown or gray with oily, water-soaked brownish margin.\nSimilar symptoms on fruit and twigs.",
		"symptoms": "Trees can be affected at all stages of their development and symptoms may appear on leaves, fruits or twigs. Tiny, slightly raised and spongy lesions develop first on both surfaces of newly-infected leaves. As they mature, these spots develop into rust-brown wart-like craters that are surrounded by a distinctive bright yellow halo. They eventually erupt, releasing their content, and forming a typical lesion with light brown or gray center and oily, water-soaked brownish margin. Occasionally, the center of old cankers fall out, leaving behind a shot-hole effect. Similar symptoms can appear on fruits and twigs, where the cankers can reach a sizable dimension. The center of the lesion becomes characteristically raised, scabby or corky. Defoliation and premature fruit drop ensue and twigs may be killed by girdling of vascular tissues. Fruits that reach maturity are not marketable.",
 		"trigger": "Citrus canker is a serious and highly contagious disease of commercial varieties of citrus and relatives. It is  caused by the bacteria Xanthomonas citri, which can survive  for periods of over 10 months in old lesions on fruits, leaves and stems. It enters plant’s tissues through wounds or natural pores in the leaf surface and grow there systemically. The craters that form on leaves and other tissues contain bacteria, that are released when wet and spread by rain splash or overhead irrigation systems over short distances. Conditions that favor the disease are high humidity, hot (20 to 30 °C) and rainy weather conditions, ideally with strong winds. Citrus psyllids, leaf miners, birds, as well as infected tools and equipment can also transmit the bacteria between trees or groves. Finally, the movement of infected plants or plant parts such as nursery trees or propagation material is also a problem.",
		"biological_control": "Sorry, we don't know of any alternative treatment against Xanthomonas axonopodis pv. citri . Please get in touch with us in case you know of something that might help to fight this disease. Looking forward hearing from you.",
  		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. Unfortunately, there is no effective control on citrus canker once it has been detected. Preventive measures such as the clearing and destruction of fallen tree material are essential to minimize the effect of the disease on the grove. The control of citrus psyllids can also be a way to limit the damage. Copper-based fungicides or bactericides can provide a barrier against infection, but they will not treat an existing infection.",
  		"preventive_measures" : "Check for quarantine regulations in the area.\nChose citrus varieties that are more resistant to the disease.\nBe sure to buy healthy plant material, if possible from certified sources.\nMonitor the trees for signs of the disease.\nPrune away the part of the trees that are infected during the dry season.\nDo not work in the field when foliage is wet.\nClean boot, clothes thoroughly when working between different orchards.\nDestroy severely infected trees to prevent infecting healthy trees nearby.\nRemove fallen leaves, fruits and branches from the ground and destroy them.\nUse windbreaks between fields to avoid propagation."
	},
	{
		"name":	"greening",
		"nutshell": "Blotchy mottling of leaves.\nYellowing of veins.\nStunted tree growth.\nPremature defoliation.\nGreening and stunting of the fruit.",
		"symptoms": "First symptom is usually the appearance of a yellow shoot on the tree, thereby one of the common name of the disease, huanglongbing (which literally means yellow dragon disease). Leaves progressively turn pale-yellow and display a diffuse blotchy mottling that may resembles zinc or manganese deficiency. A common way to tell these disorders apart is that the symptoms of these deficiencies tend to be symmetrical along the leaf vein, while those of the disease are asymmetrical. Chronically infected trees show stunted growth, premature defoliation and twig dieback. Trees may bear multiple off-season flowers that later fall off and small, irregular fruits with a thick, pale peel that remains green at the bottom (thereby the name citrus greening disease).",
		"trigger": "The symptoms of huanglongbing (HLB) are caused by the bacterium Candidatus Liberibacter asiaticus. It is transmitted persistently by two psyllid vectors that are omnipresent in the citrus grooves, Diaphorina citri and Trioza erytreae. HLB can be acquired by both nymphs and adults, which can maintain and transmit the disease throughout their 3- to 4-month lifespan. Huanglongbing is systemic and has an incubation period of three months to several years before symptoms are visible. The disease can also be spread through grafting, even though with variable transmission rates. Seed transmission may also be possible. Other pathologies or disorders also show such a mottling of the leaves. It is thus recommended to send samples of tissues for analysis in laboratories to ascertain the cause.",
		"biological_control": "Sorry, we don't know of any biological treatment against this disease. Please get in touch with us in case you know of something that might help to fight this disease. We are looking forward hearing from you.",
		"chemical_control": "Always consider an integrated approach with preventive measures and biological treatments if available. An appropriate use of insecticides has resulted in good control of the psyllid vectors and thus a limited spread of the disease. Injection of the antibiotic tetracycline into the trunk of the trees may result in a partial recovery but has to be repeated often to show effect. Tetracycline is phytotoxic and may have adverse effects on the environment. For these reasons, its use has decreased in recent years.",
		"preventive_measures": "Be aware of possible quarantine regulations in the country.\nMonitor the citrus groove regularly for symptoms of the disease.\nRemove affected trees immediately.\nMaintain a thorough standard of hygiene among workers and tools involved in citrus growing.\nRemove alternative hosts of the psyllids such as Murraya paniculata, Severinia buxifolia, and other plants in the same family as citrus (Rutaceae)."
	},
	{
		"name":	"gummosis",
		"nutshell": "Dark water-soaked areas in the bark extending from the soil line.\nWater-soluble gum exuding from cracks in bark in dry weather.\nBark below soil is water-soaked, slimy and reddish-brown to black.\nNecrotic areas can extend to inner tissues and encircle the bark, leading to collapse.",
		"symptoms": "Symptoms of foot rot or gummosis often start appearing near the soil line. Dark water-soaked areas are formed in the bark and a sour smell may emanate from them in wet conditions. Water-soluble gum exudes from longitudinal cracks in the bark, especially in dry weather. Bark below the soil line turns water soaked, slimy, reddish-brown, or black in late stages. Brown necrotic areas can extend to internal tissues of wood. Foliage turns yellow due to nutrition deficiency. At later stages, the dead bark dries, shrinks and cracks and patches may fall off, leaving an open canker. Trees may collapse and die if the fungus encircles the bark. Infected fruits develop a soft brown rot that eventually produces a characteristic pungent odor.",
        "trigger": "The symptoms are caused by different species of Phytophthora fungi. They produce a large number of water-borne spores that under favorable conditions (high moisture and elevated temperatures) can swim over short distances. These spores are the infective agents that may be transported in rain or irrigation to the roots of the trees. They germinate and enter the root tip resulting in rot of the entire rootlet, later extending to the rest of the root. Foot rot or gummosis occur when these spores are splashed onto a wound or bark crack around the base of the trunk. The susceptibility of the tree depends on the Phytophthora species present and is greatly influenced by the prevailing environmental conditions (type of soil, presence of water).",
        "biological_control": "Exposing the seeds to hot water (about 49 degrees) for 4-10 minutes eradicates seedborne infection. The insertion of chlorine into micro-irrigation systems effectively reduces Phytophthora infections. Some fungal or bacterial species (Trichoderma spp. and Bacillus spp.) have been tested as control agents for Phytophthora with good results. Copper fungicides can also be used to control the disease at early stages.",
        "chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. The treatment of the orchard with fungicides containing metalaxyl and fosetyl-aluminium is an effective complement to preventive and biological control of the fungus. Foliar applications of fosetyl-aluminium and a soil drench of metalaxyl showed very good results. Both preharvest sprays, postharvest dip treatments and/or the use of impregnated wrappers is recommended.",
    	"preventive_measures": "Sow seeds from certified sources.\nSelect resistant or tolerant varieties for the orchard.\nThe nursery site should be well drained.\nMake sure that tools are disinfected before use.\nPlant the trees on cambered beds to prevent losses from the disease.\nAvoid wounding, especially near the trunk base.\nRemove dead or infected tree material immediately.\nInspect the orchard regularly for signs of the disease down to the first lateral roots.\nAvoid contact between furrow irrigation water and the trunk of trees."

	},
	{
		"name": "healthy"
	},
	{
		"name": "leaf_miner",
		"nutshell": "Leaf deformation - twisted or curled appearance.\nWhite or gray tunnels on leaf surface.\nStunted growth.\nReduced fruit size.\nTiny, brownish or gray moths with dark spot on front wing.",
		"symptoms": "The infestation can occur at any growth stage and is mainly visible on young leaves. Initial symptoms may be the appearance of deformed, twisted or curled leaves, that however, remain green. A close look reveals serpentine white or gray mine trails between the two leaf epidermis. A thin dark streak or dotted dark line, that corresponds to the larval frass, is visible inside the tunnels, more conspicuous from the underside. Larvae are often found at the end of these tunnels and several of them can be present per leaf. The damage to the leaves can be a source of infection by opportunistic fungi or bacteria. Heavy infestation can also lead to lower photosynthetic rates, resulting in stunted growth, reduced fruit size and quality. In severe cases, citrus leafminer infection can even cause total tree defoliation and eventual death for young trees.",
		"trigger": "Symptoms are caused by the feeding activity of the larvae of the citrus leafminer, Phyllocnistis citrella. The adults are tiny, brownish or gray moths with heavily fringed wings and a typical dark spot on the top of the front wing. They are mainly active during the cool temperatures of dawn and dusk, early morning and night. In spring, the females lay their eggs on the lower side of leaves. The hatching larvae are translucent greenish or yellow and feed mainly on leaves, even though fruits can also be attacked. They bore tunnels between the two leaf epidermis, resulting in distinctive silvery, serpentine mines. At the end of the larval stage, the leafminer emerge from the mine and enters its pupa stage by curling the leaf around itself. It is a major pest of citrus, found in virtually all major citrus-producing areas. Moreover, the susceptibility to other diseases, such as bacterial canker, is increased.",
		"biological_control": "Predators include the green lacewings of the Neuroptora genus. There is also a wide array of parasitic wasps that attack and feed on the larvae of the citrus leafminer, among others, species of Tetrastichus. Organic insecticides containing spinosad, fish oil resin soap and Pongamia oil may be used as foliar spray applications to control the infestation by citrus leafminer. Neem oil can also be applied to deter the moths from laying their eggs on the leaves.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments. Insecticides are not entirely effective against infestations of citrus leafminer because larvae are protected by the leaf cuticle. If insecticides are needed, systemic and contact products should be applied when the adults are active. Several products are available as sprays, among others formulations containing abamectin, tebufenozide, acetamiprid, diflubenzuron or spinetoram. Insecticides of the synthetic pyrethroid family were also used against this pest.",
		"preventive_measures":"Select varieties that are partly resistant to the citrus leafminer.\nPlant billy goat weed (Ageratum conyzoides) as ground cover between the trees.\nMonitor orchards regularly, mainly the underside of leaves, for signs of the disease.\nCollect and destroy fallen leaves in winter to reduce insect hidings.&q;,&q;Use pheromone traps to attract the moths and monitor populations.\nPrune the trees so that to avoid the appearance of new growth during peaks of infestation.\nPrune suckers accordingly.\nAvoid an excess of pesticides that can harm beneficial insects"

	},
	{
		"name": "lemon_butterfly"
	}
]