[
	{
		"name": "bacterial_spot",
		"nutshell": "◉ Small, yellow-green lesions on young leaves.\n◉ Leaves deformed and twisted.\n◉ Dark, water-soaked lesions with yellow halo on older leaves and fruits.",
		"symptoms": "These bacteria attack the foliage, stems, and fruit of tomatoes. The first symptoms are small, yellow-green lesions on young leaves, which usually appear deformed and twisted. On older foliage, lesions are limited by veins, acquiring an angular aspect over time. They are first dark-green, greasy in appearance, and often surrounded by a yellow halo. They are usually more numerous on leaf margins or tips. If conditions are met, they enlarge rapidly to a size of 0.25 to 0.5 cm wide and become tan to brownish-red. Eventually, the spots look like shot holes because the center dries up and disintegrates. Fruit spots (up to 0.5 cm) start off as pale-green, water-soaked areas with a yellow halo and eventually roughen, becoming brown and scabbed.",
		"trigger": "Bacterial spot is caused by several species of bacteria of the genus Xanthomonas. It occurs worldwide and is one of the most devastating diseases on tomatoes grown in warm, moist environments. The pathogen can survive in or on seeds, on plant debris and on specific weeds. It has a very limited survival period of days to weeks in the soil. When conditions are favorable, it spreads through rain or overhead irrigation onto healthy plants. It enters the plant tissues through leaf pores and wounds. Optimum temperatures range from 25 to 30°C. Once the crop is infected, the disease is very difficult to control and can lead to total crop losses.",
		"biological_control": "Bacterial spot is very difficult and expensive to treat. If the disease occurs early in the season, consider destroying the entire crop. Copper-containing bactericides provide a protective cover on foliage and fruit. Bacterial viruses (bacteriophages) that specifically kill the bacteria are available. Submerging seeds for one minute in 1.3% sodium hypochlorite or in hot water (50°C) for 25 minutes can reduce incidence of disease.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. Copper-containing bactericides can be used as protectant and give partial disease control. Application at first sign of disease and then at 10 to 14 day intervals when warm, moist conditions prevail. As the development of resistance to copper is frequent, a combination of copper-based bactericide with mancozeb is also recommended.",
		"preventive_measures": "◉ Plant disease-free seeds if possible from a certified source.\n◉ Use resistant varieties if available locally.\n◉ Inspect field regularly, particularly during overcast weather.\n◉ Remove and burn any seedling or plant part with leaf spots.\n◉ Remove weeds in and around the field.\n◉ Mulch the soil to avoid soil to plant contamination.\n◉ Clean tools and equipment.\n◉ Avoid overhead irrigation and working in fields when foliage is wet.\n◉ Plow deep plant debris after harvest.\n◉ Alternatively, remove plant debris and leave the soil idle for some weeks or month (solarization).\n◉ Plan a 2-3 years crop rotation with a non-susceptible crop."
	},
	{
		"name": "early_blight",
		"nutshell": "◉ Dark spots with concentric growth and yellow halos on leaves.\n◉ Leaves dry out and fall off.\n◉ To a lesser degree on stems and fruits.\n◉ Fruits may start to rot and eventually drop.",
		"symptoms": "Symptoms of early blight occur on older foliage, stem, and fruits. Gray to brown spots appear on leaves and gradually grow in a concentric manner around a clear center - the characteristic “bullseye” formation. These lesions are surrounded by a bright yellow halo. As the disease progresses, entire leaves may turn chlorotic and shed, leading to significant defoliation. When leaves die and fall, fruits become more vulnerable to sun scald. The same type of spots with a clear center appears on stems and fruits. Rotting of fruits and sometimes dropping follows.",
		"trigger": "Symptoms are caused by Alternaria solani, a fungus that overwinters on infected crop debris in soil or on alternative hosts. Purchased seeds or seedlings may also be already contaminated. Lower leaves often get infected when in contact with contaminated soil. Warm temperatures (24-29°C) and high humidity (90%) favor development of the disease. A long wet period (or alternating wet/dry weather) enhances the production of spores, which may be spread via wind, splashing rain or overhead irrigation. Tubers harvested green or in wet conditions are particularly susceptible to an infection. It often strikes after a period of heavy rainfall and is particularly destructive in tropical and subtropical areas.",
		"biological_control": "Small farmers may use algal limestone, a mixture of fat-free milk and water (1:1) or rock flour to treat infected plants. A solution of 3 teaspoon of bicarbonate of soda + fish emulsion in 4 liters of water also help. Application of products based on Bacillus subtilis or copper-based fungicides registered as organic also work.",
		"chemical_control": "Always consider an integrated approach with preventive measures and biological treatments if available. There are numerous fungicides on the market for controlling early blight. Fungicides based on or combinations of azoxystrobin, pyraclostrobin, difenoconazole, boscalid, chlorothalonil, fenamidone, maneb, mancozeb, trifloxystrobin and ziram can be used. Rotation of different chemical compounds is recommended. Apply treatments in a timely manner, taking into account weather conditions. Check carefully the preharvest interval at which you can harvest safely after the application of these products.",
		"preventive_measures": "◉ Use certified pathogen-free seeds or transplants.\n◉ Look for varieties that are resistant to the disease.\n◉ Plant or transplant on raised beds to improve drainage.\n◉ Orient rows in the direction of main winds and avoid shaded areas.\n◉ Space plants to allow canopy to dry quickly after rainfall or irrigation.\n◉ Lay mulch on the soil to keep plants from touching the soil.\n◉ Monitor fields for signs of the disease, particularly during wet weather.\n◉ Remove bottom leaves that are too close to the soil.\n◉ Remove leaves displaying symptoms and destroy them.\n◉ Keep plants strong and vigorous with an adequate nutrition.\n◉ Use stakes to keep plants upright.\n◉ Use a drip irrigation system to minimize leaf wetness.\n◉ Water plants in the morning so plants dry during the day.\n◉ Control susceptible weeds in and around the field.\n◉ Avoid to work in fields when plants are wet.\n◉ After harvest, remove plant debris and burn them (do not compost).\n◉ Alternatively, plow debris deep in the soil (more than 45 cm).\n◉ Plan a 2- or 3-year crop rotation with non-susceptible crops.\n◉ Store tubers at cool temperatures and in well aerated sites."
	},
	{
		"name": "healthy"
	},
	{
		"name": "late_blight",
		"nutshell": "◉ Brown leaf spots - start from margin.\n◉ White covering on the underside of leaves.\n◉ Grey or brown wrinkled stains on fruits.\n◉ Hardened fruit flesh spots and fruit decay.",
		"symptoms": "Brownish-green spots appear on the leaf margins and leaf tops. Later, large areas of the leaves turn brown completely. During wet weather, lesions on the lower side of the leaves may be covered with a gray to white moldy growth, making it easier to distinguish healthy from dead leaf tissue. As the disease progresses, the foliage runs brown, curls and dries. In some cases, the sharply delimited brown spots and the white covering also appear on the stems, branches and petioles. Greyish-green to dirty-brown and wrinkled stains appear on the fruits. At these spots, the fruit flesh is hardened.",
		"trigger": "Risk of infection is highest in midsummer. The fungus enters the plant via wounds and rips in the skin. Temperature and moisture are the most important environmental factors affecting the development of the disease. Late blight fungi grow best in high relative humidities (around 90%) and in temperature ranges of 18 to 26°C. Warm and dry summer weather can bring the spread of the disease to a halt.",
		"biological_control": "At this point, there is no biological control of known efficacy against late blight. To avoid spreading, remove and destroy plants around the infected spot immediately and do not compost infected plant material.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. Use fungicide sprays based on mandipropamid, chlorothalonil, fluazinam, mancozeb to combat late blight. Fungicides are generally needed only if the disease appears during a time of year when rain is likely or overhead irrigation is practiced.",
		"preventive_measures": "◉ Purchase healthy seeds from reliable retailers.\n◉ Plant more resilient varieties.\n◉ Tomatoes and potatoes should not be cultivated next to each other.\n◉ Try to keep plants dry though good drainage and ventilation of your cultures.\n◉ Installing a simple transparent rain shelter with the help of a tarpaulin and wooden stakes might help.\n◉ Silicate-containing fertilizers may increase the resistance to the fungus, especially in the seedling stage.\n◉ Avoid irrigation late in the day and irrigate plants at ground level.\n◉ Disinfect field equipment and tools.\n◉ Use plant fortifier for general strengthening of the plants.\n◉ Crop rotation of two to three years with non-host crops is recommended."
	},
	{
		"name": "leaf_mold",
		"nutshell": "◉ Pale green or yellowish diffuse spots on upper leaf side.\n◉ Olive green to grayish purple patches on underside.\n◉ Drying and curling of leaves.",
		"symptoms": "Symptoms commonly occur on both sides of the foliage and sometimes on fruit. Older leaves are infected first and then the disease slowly moves up towards young leaves. On the upper leaf surface, small, diffuse, pale green or yellowish spots with indefinite margins appear. On the underside, olive green to grayish purple and velvety patches develop below the leaf spots. These are composed of spore-producing structures and spore masses (conidia). Over time, as the spots enlarge, the color of the infected leaf changes from yellowish (chlorosis) to brown (necrosis) and the leaf begins to curl and dry. The leaves will drop prematurely, leading to defoliation in severe cases. Occasionally, this pathogen causes disease on the blossoms or fruits with various symptoms. The blossoms may turn black and will be killed before fruit set. Green and ripe fruits will develop smooth black irregular area on the stem end. As the disease progresses, the infected area becomes sunken, dry and leathery.",
		"trigger": "The symptoms are caused by the fungus Mycovellosiella fulva, whose spores can survive without a host for 6 months to a year at room temperature (non-obligate). Prolonged leaf moisture and humidities above 85% favor the germination of spores. The temperature must be between 4° to 34 °C for spores to germinate, with an optimum temperature at 24-26°C. Dry conditions and the absence of free water on leaves impair germination. The symptoms usually start to appear 10 days after inoculation with the development of spots on both sides of the leaf blade. On the underside, a large number of spore-producing structures are formed and these spores are easily spread from plant to plant by the wind and water splashing, but also on tools, clothing of workers and insects. The pathogen usually infects the leaves by penetrating through stomata in a high humidity level.",
		"biological_control": "Seed treatment with hot water (25 minutes at 122 °F or 50 °C) is recommended to avoid the pathogen on seeds. The fungi Acremonium strictum, Dicyma pulvinata, Trichoderma harzianum or T. viride and Trichothecium roseum are antagonistic to M. fulva and could be used to reduce its spread. In greenhouse trials the growth of M. fulva on tomatoes was inhibited by A. strictum, Trichoderma viride strain 3 and T. roseum by 53, 66 and 84% respectively. In small arms, apple-cider, garlic or milk sprays and vinegar mix can be used to treat the mold.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. Applications should be made prior to infection when environmental conditions are optimal for the development of the disease. Recommended compounds in field use are chlorothalonil, maneb, mancozeb and copper formulations. For greenhouses, difenoconazole, mandipropamid, cymoxanil, famoxadone and cyprodinil are recommended.",
		"preventive_measures": "◉ Use certified, disease-free seeds, plant resistant or resilient varieties if available in your area.\n◉ Plant early to reduce the disease severity.\n◉ Adjust row and plant spacing to enhance air circulation and reduce humidity in the canopy.\n◉ Monitor for disease and rogue infected plants as soon as detected.\n◉ Avoid excessive nitrogen fertilization.\n◉ Promote air circulation inside the greenhouse.\n◉ Keep the relative humidity below 85% and night temperatures higher than outside temperatures (suitable on greenhouse).\n◉ Use drip irrigation and avoid watering foliage.\n◉ Use a stake, strings, or prune the plant to keep it upstanding and increase airflow in and around it.\n◉ Remove and destroy (burn) all plants debris after the harvest.\n◉ Sanitize the greenhouse between crops and maintain extensive hygiene standards with tools and among workers."
	},
	{
		"name": "mosaic_virus",
		"nutshell": "◉ Infected leaves are distorted.\n◉ Green and yellow mottling on leaves. \n◉ Plants are stunted to varying degrees and fruit set may be severely reduced.\n◉ Maturing fruits develop brown spots on their surface and internal brown blotches on their flesh.",
		"symptoms": "All plant parts can be affected during any growth stage. The symptoms depend on environmental conditions (light, day length, temperature). Infected leaves show a green and yellow mottling or a mosaic pattern. Younger leaves are slightly distorted. Older leaves show raised dark green areas. In some cases, dark necrotic streaks appear in stems and petioles. Plants are stunted to varying degrees and fruit set may be severely reduced. Unevenly ripening fruits develop brown spots on their surface, and internal, browning blotches in the fruit wall. Crop yield might be reduced significantly.",
		"trigger": "Virus can persist in plant or root debris in dry soil for periods of over 2 years (1 month in most soils). Plants get contaminated through minor wounds in roots. The virus can spread via infested seeds, seedlings, weeds and contaminated plant parts. Wind, rain, grasshoppers, small mammals and birds can also transport the virus between fields. Bad cultural practices during plant handling favor virus transmission, too. Day length, temperature, and light intensity as well as plant variety and age determine the severity of the infection.",
		"biological_control": "Dry heating seeds at 70°C for 4 days or at 82-85°C for 24 hours will help to rid them of the virus. Alternatively, seeds can be soaked for 15 min in a solution of 100 g/l of trisodium phosphate, rinsed thoroughly with water and dried.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. There is no effective chemical treatment against Tomato Mosaic Virus.",
		"preventive_measures": "◉ Use seeds from healthy plants or from certified sources.\n◉ Use resistant or tolerant varieties.\n◉ Use steam-pasteurization to rid your seedbed soils of the virus.\n◉ Do not plant in fields previously infected by the virus.\n◉ Optimize the handling of the plants by washing hands, wearing gloves and disinfecting your tools and equipment.\n◉ Do not consume tobacco products (such as cigarettes) around tomato plants.\n◉ Monitor seedbeds and fields, remove diseased plants and burn them.\n◉ Avoid to plant alternative host plants close to tomatoes.\n◉ Implement crop rotation with non-host crops for at least two years.\n◉ Find and eradicate weeds in and around the field.\n◉ Plow and burn plant debris after harvest."
	},
	{
		"name": "septoria_leaf_spot",
		"nutshell": "◉ Small gray circular spots with dark-brown margins on undersides of older leaves.\n◉ Black dots in their centers.\n◉ Leaves turn slightly yellow, wither, and fall off.\n◉ Stems and blossoms can also be affected.",
		"symptoms":"Symptoms spread upwards from oldest to youngest growth. Small, water-soaked grey circular spots with dark-brown margins appear on the undersides of older leaves. At later stages of the disease, the spots enlarge and coalesce, and black dots appear in their centers. The same pattern may also be observed on stems and blossoms, but rarely on fruit. Heavily infected leaves will turn slightly yellow, wither, and fall off. The defoliation leads to sun scalding of fruit.",
		"trigger":"Septoria leaf spot occurs worldwide and is caused by the fungus Septoria lycopersici. The fungus infects only plants of the family of potato and tomato. The temperature range for the development of the fungus varies between 15° and 27°C, with optimal growth at 25°C. Spores might be spread by overhead water, splashing rain, hands and clothing of pickers, insects such as beetles, and cultivation equipment. It overwinters on solanaceous weeds and for short periods in soils or soil debris.",
		"biological_control":"Copper-based fungicides, such as Bordeaux mixture, copper hydroxide, copper sulfate, or copper oxychloride sulfate might help control the pathogen. Apply at 7 to 10 day intervals throughout the late season. Follow harvest restrictions listed on the pesticide label.",
		"chemical_control":"Always consider an integrated approach with preventive measures together with biological treatments if available. Fungicides containing maneb, mancozeb, chlorothalonil effectively control Septoria leaf spot. Apply at 7 to 10 day intervals throughout the season, mainly during flowering and fruit setting. Follow harvest restrictions listed on the pesticide label.",
		"preventive_measures": "◉ Acquire certified disease-free seeds.\n◉ If available, use resistant varieties.\n◉ Apply organic or plastic mulch to avoid transmission from soil.\n◉ Remove infected leaves and destroy them.\n◉ Improve air circulation and keep plants off the ground with stakes.\n◉ Make sure that production areas are free of susceptible weeds.\n◉ Do not use sprinklers or other overhead irrigation.\n◉ Keep your equipment and tools clean after field work.\n◉ Dig plant debris deep in the soil after harvest.\n◉ Alternatively, remove and destroy them.\n◉ Plan a crop rotation for several years with non-susceptible plants."
	},
	{
		"name": "target_spot",
		"nutshell": "◉ Foliar lesions are brown, circular, frequently ringed, with yellow halos (left photo).\n◉ On young fruit, the lesions are small, light-brown with darker margins, and centers that are slightly sunken and dry.\n◉ On ripening fruit, large circular lesions develop with brown centers that crack.",
		"trigger": "The fungus attacks many hosts such as tomato, pepper, tobacco, soybean, cowpea, snap beans, and cucurbits; certain strains only affect certain hosts. Disease development is favored by warm temperatures and extended periods of leaf wetness. The optimal temperature range for disease development is 20–28 °C with 16 hr or more of leaf wetness. The fungus sporulates abundantly on rain-moistened crop debris or from target spot lesions on dead tomato leaves. The fungus can colonize weeds or other crop plants. It remains viable for up to two years. The spores are readily dispersed by wind or windblown rain. Splashing soil or windblown soil particles create wounds in the fruit for the spores to enter. The fungus has been shown to be seed-borne in soybean, but seed-borne survival in vegetable crops is not known at this time.",
		"symptoms": "Symptoms appear on all aboveground parts of the plant. Foliar lesions begin as small, pinpoint, water-soaked spots on the upper surface. Gradually these increase in size (up to 2 cm diameter), becoming circular, frequently ringed, and pale brown with conspicuous yellow halos. The lesions will coalesce leading to blighting of foliage. The subsequent premature defoliation affects fruit quality and yield. The lesions on stems and petioles are brown and oblong. These increase in size and may girdle petioles and stems leading to collapse of the leaflets. On young fruit, the lesions are small, light-brown freckles with darker margins, and centers that are slightly sunken and somewhat dry. Fruit lesions enlarge and coalesce resulting in large areas of sunken, necrotic tissue. On ripe fruit, large circular lesions develop with brown centers that crack. Severe fruit infection and subsequent damage can cause significant yield loss. In the early stages of disease development, symptoms of target spot may be confused with those of bacterial spot (Xanthomonas campestris pv. vesicatoria) and early blight (Alternaria solani).",
		"chemical_control" : "Spray with protectant fungicides after first symptoms appear. Consult with your local extension agent for fungicides available in your region.",
		"biological_control": "Remove affected debris to prevent carryover into the next crop. Use an adequate period of crop rotation. Genetic resistance to this fungus has been documented in tomato and soybean but commercial varieties are not yet available.",
		"preventive_measures" : "◉Plant disease-free seeds if possible from a certified source.\n◉Use resistant varieties if available locally.\n◉Inspect field regularly, particularly during overcast weather.\n◉Remove and burn any seedling or plant part with leaf spots.\n◉Remove weeds in and around the field.\n◉Mulch the soil to avoid soil to plant contamination.\n◉Clean tools and equipment.\n◉Avoid overhead irrigation and working in fields when foliage is wet.\n◉Plow deep plant debris after harvest.\n◉Alternatively, remove plant debris and leave the soil idle for some weeks or month (solarization).\n◉Plan a 2-3 years crop rotation with a non-susceptible crop."
	},
	{
		"name": "two_spotted_spider_mite",
		"nutshell": "◉ Tiny spots on leaves.\n◉ Small webs can be found between stem and leaf.\n◉ Dried out leaves.\n◉ Tiny, pale green, oval mites.",
		"symptoms": "The spider mites feeding causes white to yellow speckles to form on the upper surface of the leaves. The eggs stick on the leaves undersides. The spider mite itself is located there, nesting in a cocoon resembling webbing. As infestation become more severe, leaves appear bronzed or silvery first and then become brittle, rip open between the leaf veins, and finally fall off. The mites spin a web that can cover the surface of the plant. Shoot tips can become bald and side shoots start to grow. In cases of heavy damage, the quantity as well as quality of fruits is reduced.",
		"trigger": "Damage is caused by spider mites from the genus Tetranychus, mainly T. urticae and T. cinnabarinus. The adult female is 0.6 mm long, pale green with two darker patches on its oval body, and long hairs on the back. Overwintering females are reddish. In spring, the females lay globular and translucent eggs on the underside of the leaves. The nymphs are pale green with darker markings on the dorsal side. The mites protect themselves with a cocoon on the underside of the leaf blades. The spider mite thrives in dry and hot climates and will produce up to 7 generations in one year in these conditions. There is a wide range of alternative hosts, including weeds.",
		"biological_control": "In case of minor infestation, simply wash off the mites and remove the affected leaves. Use preparations based on rapeseed, basil, soybean and neem oils to spray thoroughly leaves and reduce populations of T. urticae. Also try garlic tea, nettle slurry or insecticidal soap solutions to control the population. In fields, employ host-specific biological control with predatory mites (for example Phytoseiulus persimilis) or the biological pesticide Bacillus thuringiensis. A second spray treatment application 2 to 3 days after the initial treatment is necessary.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. The spider mite is very difficult to control with acaricides because most populations develop resistance to different chemicals after a few years of use. Choose chemical control agents carefully so that they do not disrupt the population of predators. Fungicides based on wettable sulphur (3g/l), spiromesifen (1 ml/l), dicofol (5 ml/l) or abamectin can be used for example (dilution in water). A second spray treatment application 2 to 3 days after the initial treatment is necessary.",
		"preventive_measures": "◉ Plant resistant varieties available.\n◉ Monitor your field regularly and check the underside of leaves.\n◉ Alternatively, shake a few insects off the leaf surface onto a white sheet of paper.\n◉ Remove affected leaves or plants.\n◉ Remove nettles and other weeds from fields.\n◉ Apply water to pathways and other dusty areas at regular intervals to avoid dusty conditions in the field.\n◉ Water your crop regularly to as stressed trees and plants are less tolerant to spider mite damage.\n◉ Control the use of insecticides to allow beneficial insects to thrive."
	},
	{
		"name": "yellow_leaf_curl_virus",
		"nutshell": "◉ Yellow and curled leaves.\n◉ Stunted growth.\n◉ Less number of fruit.",
		"symptoms": "When it infects plants at the seedling stage, TYLCV causes severe stunting of young leaves and shoots, resulting in a somewhat bushy growth of the plant. In older plants, the infection results in excessive branching, thicker and wrinkled leaves, and interveinal chlorosis clearly visible on the blade. At later stages of the disease, they take a leathery texture and their chlorotic margins are rolled upwards and inwards. If the infection takes place before the flowering stage, the number of fruits is considerably reduced, even though there are no noticeable symptoms on their surface.",
		"trigger": "TYLCV is not seed-borne and is not transmitted mechanically. It is spread by whiteflies of the Bemisia tabaci species. These whiteflies feed on the lower leaf surface of a number of plants and are attracted by young tender plants. The whole infection cycle can take place in about 24 hours and is favored by dry weather with high temperatures.",
		"biological_control": "Sorry, we don't know any alternative treatment against TYLCV.",
		"chemical_control": "Always consider an integrated approach with preventive measures together with biological treatments if available. Insecticides of the family of the pyrethroids used as soil drenches or spray during the seedling stage can reduce the population of whiteflies. However, their extensive use might promote resistance development in whitefly populations.",
		"preventive_measures": "◉ Use resistant or tolerant varieties.\n◉ Plant early to avoid peak populations of the whitefly.\n◉ Intercrop with rows of non-susceptible plants such as squash and cucumber.\n◉ Use nets to cover seedbeds and prevent whiteflies to reach your plants.\n◉ Avoid to plant alternative host plants close to your crops.\n◉ Mulch the seedbed or the field to break the life cycle of the whitefly.\n◉ Use sticky yellow plastic traps to mass-catch the insect.\n◉ Monitor the field, handpick diseased plants and bury them away from the field.\n◉ Find and eradicate weeds in and around the field.\n◉ Plow deep all plant debris after harvest or burn them.\n◉ Practice crop rotation with non-susceptible plants."
	}
]