{
    "plant_id" : 6,
    "nutshell": "Blotchy mottling of leaves.\nYellowing of veins.\nStunted tree growth.\nPremature defoliation.\nGreening and stunting of the fruit.",
    "symptoms": "First symptom is usually the appearance of a yellow shoot on the tree, thereby one of the common name of the disease, huanglongbing (which literally means yellow dragon disease). Leaves progressively turn pale-yellow and display a diffuse blotchy mottling that may resembles zinc or manganese deficiency. A common way to tell these disorders apart is that the symptoms of these deficiencies tend to be symmetrical along the leaf vein, while those of the disease are asymmetrical. Chronically infected trees show stunted growth, premature defoliation and twig dieback. Trees may bear multiple off-season flowers that later fall off and small, irregular fruits with a thick, pale peel that remains green at the bottom (thereby the name citrus greening disease).",
    "trigger": "The symptoms of huanglongbing (HLB) are caused by the bacterium Candidatus Liberibacter asiaticus. It is transmitted persistently by two psyllid vectors that are omnipresent in the citrus grooves, Diaphorina citri and Trioza erytreae. HLB can be acquired by both nymphs and adults, which can maintain and transmit the disease throughout their 3- to 4-month lifespan. Huanglongbing is systemic and has an incubation period of three months to several years before symptoms are visible. The disease can also be spread through grafting, even though with variable transmission rates. Seed transmission may also be possible. Other pathologies or disorders also show such a mottling of the leaves. It is thus recommended to send samples of tissues for analysis in laboratories to ascertain the cause.",
    "biological_control": "Sorry, we don't know of any biological treatment against this disease. Please get in touch with us in case you know of something that might help to fight this disease. We are looking forward hearing from you.",
    "chemical_control": "Always consider an integrated approach with preventive measures and biological treatments if available. An appropriate use of insecticides has resulted in good control of the psyllid vectors and thus a limited spread of the disease. Injection of the antibiotic tetracycline into the trunk of the trees may result in a partial recovery but has to be repeated often to show effect. Tetracycline is phytotoxic and may have adverse effects on the environment. For these reasons, its use has decreased in recent years.",
    "preventive_measures": "Be aware of possible quarantine regulations in the country.\nMonitor the citrus groove regularly for symptoms of the disease.\nRemove affected trees immediately.\nMaintain a thorough standard of hygiene among workers and tools involved in citrus growing.\nRemove alternative hosts of the psyllids such as Murraya paniculata, Severinia buxifolia, and other plants in the same family as citrus (Rutaceae)."
}
